erp3l/src/Catalogs/УсловияПредоставленияСкидокНаценок/УсловияПредоставленияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УсловияПредоставленияСкидокНаценок</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УсловиеПредоставления</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      <types>EnumRef.УсловияПредоставленияСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОпределенияПериодаНакопительнойСкидки</name>
    <type>
      <types>EnumRef.ВариантыОпределенияПериодаНакопительнойСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНакопления</name>
    <type>
      <types>EnumRef.ВариантыНакопленияКумулятивнойСкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>КритерийОграниченияПримененияЗаОбъемПродаж</name>
    <type>
      <types>EnumRef.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОграничения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикОплаты</name>
    <type>
      <types>CatalogRef.ГрафикиОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеУсловияОграничения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СегментНоменклатурыОграничения</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНакопления</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСравнения</name>
    <type>
      <types>EnumRef.ТипыСравненияЗначенийСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКартыЛояльности</name>
    <type>
      <types>CatalogRef.ВидыКартЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментПартнеров</name>
    <type>
      <types>CatalogRef.СегментыПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовНакопления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтбораНоменклатуры</name>
    <type>
      <types>EnumRef.ВариантыОтбораНоменклатурыДляРасчетаСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейДоДняРождения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейПослеДняРождения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьТекущуюПродажуВНакопленныйОбъемПродаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыВнешнейОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВремяДействия</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Enums/УсловияПредоставленияСкидокНаценок/УсловияПредоставленияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УсловияПредоставленияСкидокНаценок</name>
  <enumValues>
    <name>ЗаРазовыйОбъемПродаж</name>
  </enumValues>
  <enumValues>
    <name>ЗаНакопленныйОбъемПродаж</name>
  </enumValues>
  <enumValues>
    <name>ЗаПробнуюПродажу</name>
  </enumValues>
  <enumValues>
    <name>ЗаПервуюПродажуПартнеру</name>
  </enumValues>
  <enumValues>
    <name>ЗаВремяПродажи</name>
  </enumValues>
  <enumValues>
    <name>ЗаГрафикОплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗаФормуОплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗаНаличиеКартыЛояльности</name>
  </enumValues>
  <enumValues>
    <name>ОграничениеПоГруппеПользователей</name>
  </enumValues>
  <enumValues>
    <name>КартаЛояльностиНеЗарегистрирована</name>
  </enumValues>
  <enumValues>
    <name>ВхождениеПартнераВСегмент</name>
  </enumValues>
  <enumValues>
    <name>ВнешняяОбработка</name>
  </enumValues>
  <enumValues>
    <name>ЗаДеньРожденияКлиента</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/УсловияПредоставленияСкидокНаценок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Получает реквизиты объекта, которые необходимо блокировать от изменения
//
// Возвращаемое значение:
//  Массив - блокируемые реквизиты объекта.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("УсловиеПредоставления");
	Результат.Добавить("ВариантОпределенияПериодаНакопительнойСкидки");
	
	Результат.Добавить("ВариантНакопления");
	Результат.Добавить("КритерийОграниченияПримененияЗаОбъемПродаж");
	Результат.Добавить("ВалютаОграничения");
	Результат.Добавить("ГрафикОплаты");
	Результат.Добавить("ФормаОплаты");
	Результат.Добавить("ЗначениеУсловияОграничения");
	Результат.Добавить("СегментНоменклатурыОграничения");
	Результат.Добавить("ПериодНакопления");
	Результат.Добавить("ТипСравнения");
	Результат.Добавить("ГруппаПользователей");
	Результат.Добавить("ВремяДействия");
	Результат.Добавить("ВидКартыЛояльности");
	Результат.Добавить("КоличествоПериодовНакопления");
	Результат.Добавить("СегментПартнеров");
	Результат.Добавить("ВариантОтбораНоменклатуры");
	Результат.Добавить("ВключатьТекущуюПродажуВНакопленныйОбъемПродаж");
	Результат.Добавить("КоличествоДнейПослеДняРождения");
	Результат.Добавить("КоличествоДнейДоДняРождения");

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
 
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.УсловияПредоставленияСкидокНаценок.ОбработатьДанныеПоУсловиямПредоставленияДляОбновленияКешированныхЗапросов";
	Обработчик.Версия = "11.5.7.149";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("75254a18-8b5f-42e9-a8cb-407750cb0fe4");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.УсловияПредоставленияСкидокНаценок.ЗарегистрироватьДанныеПоУсловиямПредоставленияКОбработкеДляОбновленияКешированныхЗапросов";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Обновление кешированных запросов для Условий предоставления скидок наценок';
									|en = 'Update cached queries for the Discount markup terms'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Справочники.УсловияПредоставленияСкидокНаценок.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Справочники.УсловияПредоставленияСкидокНаценок.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.Справочники.УсловияПредоставленияСкидокНаценок.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеПоУсловиямПредоставленияКОбработкеДляОбновленияКешированныхЗапросов(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = "Справочник.УсловияПредоставленияСкидокНаценок";
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Ссылка");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УсловияПредоставленияСкидокНаценок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УсловияПредоставленияСкидокНаценок КАК УсловияПредоставленияСкидокНаценок
	|ГДЕ
	|	(УсловияПредоставленияСкидокНаценок.УсловиеПредоставления = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаРазовыйОбъемПродаж)
	|	ИЛИ
	|		УсловияПредоставленияСкидокНаценок.УсловиеПредоставления = ЗНАЧЕНИЕ(Перечисление.УсловияПредоставленияСкидокНаценок.ЗаНакопленныйОбъемПродаж))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЭлементыДляРегистрации = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		
		Если СкидкиНаценкиСервер.НеобходимаРегистрация(Выборка.Ссылка) Тогда
			ЭлементыДляРегистрации.Добавить(Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ЭлементыДляРегистрации);
	
КонецПроцедуры

Процедура ОбработатьДанныеПоУсловиямПредоставленияДляОбновленияКешированныхЗапросов(Параметры) Экспорт
	
	ПолноеИмяОбъекта        = "Справочник.УсловияПредоставленияСкидокНаценок";
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Для Каждого ЭлементСправочника Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ЭлементСправочника.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			СправочникОбъект = ЭлементСправочника.Ссылка.ПолучитьОбъект();
			
			Если СправочникОбъект = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ЭлементСправочника.Ссылка);
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;

			СкидкиНаценкиСервер.ОбновитьКэшированныйЗапрос(СправочникОбъект);
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ЭлементСправочника.Ссылка);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
